# customer-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-customer/runs/run-efoWpgvuwjVpuuHL

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer-database-migration]
module.database.cockroach_database.default: Refreshing state... [id=4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Refreshing...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=staging-cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.cockroach_database.default will be destroyed
  # (because cockroach_database.default is not in configuration)
  - resource "cockroach_database" "default" {
      - cluster_id  = (sensitive value) -> null
      - id          = "4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer" -> null
      - name        = "staging-customer" -> null
      - table_count = 5 -> null
    }

  # module.database_migration_user.cockroach_sql_user.default will be destroyed
  # (because cockroach_sql_user.default is not in configuration)
  - resource "cockroach_sql_user" "default" {
      - cluster_id = (sensitive value) -> null
      - id         = "4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer-database-migration" -> null
      - name       = "staging-customer-database-migration" -> null
      - password   = (sensitive value) -> null
    }

  # module.database_migration_user.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - keepers          = {
          - "random_seed" = "e684fddc-b9b2-484b-8de7-62705f20394a"
        } -> null
      - length           = 64 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "!#$%&*()-_=+[]{}<>:?" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.common_resources.module.database.cockroach_database.default will be created
  + resource "cockroach_database" "default" {
      + cluster_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "staging-customer"
      + table_count = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "cluster_id" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "staging-cockroachdb-serverless-cluster-id"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-customer-database-migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "staging-customer-database-migration"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_migration_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "b9cfe96a-27a4-4882-8eca-e624d1452c41"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*